test2_troubleshooting/benchmark_results/post-optimization-pypy-1.txt
hey -n 100 -c 1   -H "User-Agent: Mozilla/5.0"   http://localhost:8081/

Summary:
  Total:	38.7938 secs
  Slowest:	1.1009 secs
  Fastest:	0.0974 secs
  Average:	0.3879 secs
  Requests/sec:	2.5777

  Total data:	11579 bytes
  Size/request:	115 bytes

Response time histogram:
  0.097 [1]	|■
  0.198 [8]	|■■■■■■■■
  0.298 [22]	|■■■■■■■■■■■■■■■■■■■■■
  0.398 [41]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.499 [3]	|■■■
  0.599 [5]	|■■■■■
  0.700 [9]	|■■■■■■■■■
  0.800 [9]	|■■■■■■■■■
  0.900 [1]	|■
  1.001 [0]	|
  1.101 [1]	|■


Latency distribution:
  10%% in 0.1989 secs
  25%% in 0.2926 secs
  50%% in 0.3037 secs
  75%% in 0.5000 secs
  90%% in 0.7002 secs
  95%% in 0.7891 secs
  99%% in 1.1009 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0006 secs, 0.0002 secs, 0.0011 secs
  DNS-lookup:	0.0002 secs, 0.0001 secs, 0.0004 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.3825 secs, 0.0970 secs, 1.0999 secs
  resp read:	0.0047 secs, 0.0001 secs, 0.0923 secs

Status code distribution:
  [200]	100 responses